// src/data.js
export const newsData = [
  {
    id: 1,
    title: "Искусственный интеллект",
    shortText: "Новая нейросеть способна генерировать полноценные музыкальные композиции в различных жанрах.",
    fullText: "Компания 'TechInnovate' представила революционную модель искусственного интеллекта под названием 'SymphonyAI'. Эта нейросеть способна анализировать тысячи музыкальных произведений и на их основе создавать уникальные мелодии, открывая новые горизонты для композиторов.",
    imageUrl: "https://images.unsplash.com/photo-1677756119517-756a188d2d94?q=80&w=1974&auto=format&fit=crop"
  },
  {
    id: 2,
    title: "Открытия на Марсе",
    shortText: "Марсоход 'Curiosity' обнаружил следы древнего озера, что подтверждает наличие воды в прошлом.",
    fullText: "Последние данные, полученные с марсохода 'Curiosity', указывают на то, что в кратере Гейла миллиарды лет назад находилось большое озеро. Это открытие укрепляет гипотезу о том, что на Марсе когда-то могли существовать условия, пригодные для жизни.",
    imageUrl: "https://storage.yandexcloud.net/incrussia-prod/wp-content/uploads/2025/07/daniele-colucci-OtXJhYjbKeg-unsplash-1.webp"
  },
  {
    id: 3,
    title: "Квантовый прорыв",
    shortText: "Физики разработали более стабильный тип кубита, что ускорит создание мощных квантовых компьютеров.",
    fullText: "Команда исследователей из MIT объявила о создании нового типа сверхпроводящего кубита, который обладает значительно большей стабильностью. Этот прорыв может стать ключевым шагом на пути к созданию полномасштабного квантового компьютера.",
    imageUrl: "https://images.unsplash.com/photo-1534796636912-3b95b3ab5986?q=80&w=2071&auto=format&fit=crop"
  },
  {
    id: 4,
    title: "Глубины океана",
    shortText: "Исследователи обнаружили новый вид глубоководных кораллов, светящихся в темноте.",
    fullText: "Международная экспедиция океанологов сделала поразительное открытие в Тихом океане. На глубине более 2000 метров был обнаружен ранее неизвестный вид кораллов, обладающих способностью к биолюминесценции. Эти организмы создают собственное свечение, освещая непроглядную тьму океанских глубин.",
    imageUrl: "https://images.unsplash.com/photo-1562088287-bde35a1ea917?q=80&w=2070&auto=format&fit=crop"
  },
  {
    id: 5,
    title: "Космический телескоп",
    shortText: "Телескоп 'Джеймс Уэбб' передал на Землю самые четкие снимки далеких галактик в истории.",
    fullText: "Астрономы опубликовали новые изображения, полученные с помощью космического телескопа 'Джеймс Уэбб'. На них с беспрецедентной детализацией запечатлены галактики, находящиеся на расстоянии более 13 миллиардов световых лет от Земли, что позволяет заглянуть в раннюю Вселенную.",
    imageUrl: "https://images.unsplash.com/photo-1614332287897-cdc485fa562d?q=80&w=2070&auto=format&fit=crop"
  }
];